|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
%pwd

'C:\\Users\\Chhavi.Bajpai\\Desktop\\PY\\Assignments'

In [2]:
# Read data and describe it
import pandas as pd
df=pd.read_csv(r"C:\Users\Chhavi.Bajpai\Desktop\PY\Assignments\titanic_dataset.csv")
print(df.head())
print(df.describe(include='all'))

   Unnamed: 0  pclass  survived  \
0           0       1         1
1           1       1         1
2           2       1         0
3           3       1         0
4           4       1         0

                                              name  gender      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton  female  29.0000      0
1                   Allison, Master. Hudson Trevor    male   0.9167      1
2                     Allison, Miss. Helen Loraine  female   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  $211.34        B5        S    2    NaN
1      2  113781  $151.55   C22 C26        S   11    NaN
2      2  113781  $151.55   C22 C26        S  NaN    NaN
3      2  113781  $151.55   C22 C26        S  NaN  135.0
4      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON
         Unnamed: 0       pclass     survived                  name gender  \
count   1309.000000  1309.000000  1309.000000                  1309   1309
unique          NaN          NaN          NaN                  1307      2
top             NaN          NaN          NaN  Connolly, Miss. Kate   male
freq            NaN          NaN          NaN                     2    843
mean     654.000000     2.294882     0.381971                   NaN    NaN
std      378.020061     0.837836     0.486055                   NaN    NaN
min        0.000000     1.000000     0.000000                   NaN    NaN
25%      327.000000     2.000000     0.000000                   NaN    NaN
50%      654.000000     3.000000     0.000000                   NaN    NaN
75%      981.000000     3.000000     1.000000                   NaN    NaN
max     1308.000000     3.000000     1.000000                   NaN    NaN

                age        sibsp        parch    ticket    fare        cabin  \
count   1046.000000  1309.000000  1309.000000      1309    1308          295
unique          NaN          NaN          NaN       929     263          186
top             NaN          NaN          NaN  CA. 2343  $8.05   C23 C25 C27
freq            NaN          NaN          NaN        11      60            6
mean      29.881135     0.498854     0.385027       NaN     NaN          NaN
std       14.413500     1.041658     0.865560       NaN     NaN          NaN
min        0.166700     0.000000     0.000000       NaN     NaN          NaN
25%       21.000000     0.000000     0.000000       NaN     NaN          NaN
50%       28.000000     0.000000     0.000000       NaN     NaN          NaN
75%       39.000000     1.000000     0.000000       NaN     NaN          NaN
max       80.000000     8.000000     9.000000       NaN     NaN          NaN

       embarked boat        body     home.dest
count      1307  486  121.000000           745
unique        3   27         NaN           369
top           S   13         NaN  New York, NY
freq        914   39         NaN            64
mean        NaN  NaN  160.809917           NaN
std         NaN  NaN   97.696922           NaN
min         NaN  NaN    1.000000           NaN
25%         NaN  NaN   72.000000           NaN
50%         NaN  NaN  155.000000           NaN
75%         NaN  NaN  256.000000           NaN
max         NaN  NaN  328.000000           NaN

In [3]:
# Find columns with missingdata
print(df.isna().sum())
# print((~df.isna()).sum())
# isna Detect missing values.Return a boolean same-sized object (data frame) indicating if the values are NA. NA values, such as
# None or numpy.NaN, gets mapped to True values.
print(df.isna().any(axis=0))
print(df.isna().all(axis=0))

Unnamed: 0       0
pclass           0
survived         0
name             0
gender           0
age            263
sibsp            0
parch            0
ticket           0
fare             1
cabin         1014
embarked         2
boat           823
body          1188
home.dest      564
dtype: int64
Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool
Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age           False
sibsp         False
parch         False
ticket        False
fare          False
cabin         False
embarked      False
boat          False
body          False
home.dest     False
dtype: bool

In [4]:
# Print shape of dataset
print(df.shape)

(1309, 15)

In [5]:
# drop columns with more than 25% missing data
print(1309*0.75)
print(1309*0.25)
print(df.isna().sum())
# df1=df.dropna(thresh=1309*0.75,axis=1)
# print(df1.isna().sum())

df.dropna(thresh=1309*0.75,axis=1,inplace=True)
print(df.isna().sum())
# print(df)

981.75
327.25
Unnamed: 0       0
pclass           0
survived         0
name             0
gender           0
age            263
sibsp            0
parch            0
ticket           0
fare             1
cabin         1014
embarked         2
boat           823
body          1188
home.dest      564
dtype: int64
Unnamed: 0      0
pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
embarked        2
dtype: int64

In [6]:
# drop columns having independent values(which do not affect the survival rate).
# Columns Unnamed: 0 and name can be dropped as they do not affect the survival rate.
df.drop(["Unnamed: 0","name"], axis=1, inplace=True)
print(df.head())

   pclass  survived  gender      age  sibsp  parch  ticket      fare embarked
0       1         1  female  29.0000      0      0   24160  $211.34         S
1       1         1    male   0.9167      1      2  113781  $151.55         S
2       1         0  female   2.0000      1      2  113781  $151.55         S
3       1         0    male  30.0000      1      2  113781  $151.55         S
4       1         0  female  25.0000      1      2  113781  $151.55         S

In [7]:
# check data types of all columns
print(df.dtypes)

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [8]:
# convert price to numeric
print(df.fare)
f1=df.fare.str.replace("$",'')
print(f1)
df.fare=f1.astype('float64')
print(df.fare)

0       $211.34
1       $151.55
2       $151.55
3       $151.55
4       $151.55
          ...
1304     $14.45
1305     $14.45
1306      $7.23
1307      $7.23
1308      $7.88
Name: fare, Length: 1309, dtype: object
0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: object
0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: float64

In [9]:
# find columns still having missing/na values and also count of missing data
print(df.isna().any(axis=0))
print(df.isna().sum())

pclass      False
survived    False
gender      False
age          True
sibsp       False
parch       False
ticket      False
fare         True
embarked     True
dtype: bool
pclass        0
survived      0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [10]:
# fill na with mean for fare and age column column.
fare_mean=df.fare.mean()
print(fare_mean)
age_mean=df.age.mean()
print(age_mean)
fare2=df.fare.fillna(fare_mean)
age2=df.age.fillna(age_mean)
df.fare=fare2
df.age=age2
print(df.isna().sum())

33.29626146789031
29.8811345124283
pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    2
dtype: int64

In [13]:
# drop na values for embarked column.
# df.drop(['embarked'], axis=1,inplace=True)
# print(df.isna().sum())
import numpy as np
emb=np.where(df.embarked.isna())
print(emb)
print(emb[0])
print(emb[0][1])

df.drop(index=emb[0], inplace=True)
print(df)
print(df.embarked.isna().sum())
print(df.shape)

(array([168, 284], dtype=int64),)
[168 284]
284
      pclass  survived  gender        age  sibsp  parch  ticket    fare  \
0          1         1  female  29.000000      0      0   24160  211.34
1          1         1    male   0.916700      1      2  113781  151.55
2          1         0  female   2.000000      1      2  113781  151.55
3          1         0    male  30.000000      1      2  113781  151.55
4          1         0  female  25.000000      1      2  113781  151.55
...      ...       ...     ...        ...    ...    ...     ...     ...
1304       3         0  female  14.500000      1      0    2665   14.45
1305       3         0  female  29.881135      1      0    2665   14.45
1306       3         0    male  26.500000      0      0    2656    7.23
1307       3         0    male  27.000000      0      0    2670    7.23
1308       3         0    male  29.000000      0      0  315082    7.88

     embarked
0           S
1           S
2           S
3           S
4           S
...       ...
1304        C
1305        C
1306        C
1307        C
1308        S

[1307 rows x 9 columns]
0
(1307, 9)

In [14]:
# dump the dataframe to a csv file 'titanic_filtered.csv'
df.to_csv('titanic_filtered.csv')

In [16]:
# for surviced column replace 0 with D and 1 with A
surv1=df.survived.replace({0:'D',1:'A'})
df.survived=surv1
print(df.survived)

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1307, dtype: object

In [17]:
# find the frequency of different values in survived column
print(df.survived.unique())
print(df.survived.value_counts())

['A' 'D']
D    809
A    498
Name: survived, dtype: int64

In [25]:
# group by gender and survived and see the counts in each category
grp1=df.groupby(by=["gender","survived"])
print(grp1.count())
print(grp1.gender.count())
print(grp1.survived.count())

                 pclass  age  sibsp  parch  ticket  fare  embarked
gender survived
female A            337  337    337    337     337   337       337
       D            127  127    127    127     127   127       127
male   A            161  161    161    161     161   161       161
       D            682  682    682    682     682   682       682
gender  survived
female  A           337
        D           127
male    A           161
        D           682
Name: gender, dtype: int64
gender  survived
female  A           337
        D           127
male    A           161
        D           682
Name: survived, dtype: int64

In [54]:
# find different pclass and no of people in each class
print(df.pclass.unique())
print(df.pclass.value_counts())

[1 2 3]
3    709
1    321
2    277
Name: pclass, dtype: int64
      pclass survived  gender   age  sibsp  parch    ticket   fare embarked
9          1        D    male  71.0      0      0  PC 17609  49.50        C
135        1        D    male  71.0      0      0  PC 17754  34.65        C
1235       3        D    male  74.0      0      0    347060   7.78        S
61         1        A  female  76.0      1      0     19877  78.85        S
14         1        A    male  80.0      0      0     27042  30.00        S
['male' 'female']
male      4
female    1
Name: gender, dtype: int64
    pclass survived  gender   age  sibsp  parch    ticket   fare embarked
14       1        A    male  80.0      0      0     27042  30.00        S
61       1        A  female  76.0      1      0     19877  78.85        S
78       1        A  female  64.0      0      2  PC 17756  83.16        C
83       1        A  female  64.0      1      1    112901  26.55        S
6        1        A  female  63.0      1      0     13502  77.96        S
61    76.0
Name: age, dtype: float64
14    80.0
Name: age, dtype: float64

          pclass        age     sibsp     parch       fare
gender
female  2.159483  28.795931  0.655172  0.635776  46.052974
male    2.372479  30.430716  0.413998  0.247924  26.163969

In [61]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
dfage1=(df.sort_values(by=["age"])).tail()
print(dfage1)
print(dfage1.gender.unique())
print(dfage1.gender.value_counts())

      pclass survived  gender   age  sibsp  parch    ticket   fare embarked
9          1        D    male  71.0      0      0  PC 17609  49.50        C
135        1        D    male  71.0      0      0  PC 17754  34.65        C
1235       3        D    male  74.0      0      0    347060   7.78        S
61         1        A  female  76.0      1      0     19877  78.85        S
14         1        A    male  80.0      0      0     27042  30.00        S
['male' 'female']
male      4
female    1
Name: gender, dtype: int64

In [60]:
# find max age male and female who survived
dfsurv1=((df[df.survived=='A']).sort_values(by=["age"], ascending=False)).head()
print(dfsurv1)
dfsurv2=(dfsurv1[dfsurv1.gender=='female']).head(1)
print(dfsurv2.age)
dfsurv3=dfsurv1[dfsurv1.gender=='male']
print(dfsurv3.age)

    pclass survived  gender   age  sibsp  parch    ticket   fare embarked
14       1        A    male  80.0      0      0     27042  30.00        S
61       1        A  female  76.0      1      0     19877  78.85        S
78       1        A  female  64.0      0      2  PC 17756  83.16        C
83       1        A  female  64.0      1      1    112901  26.55        S
6        1        A  female  63.0      1      0     13502  77.96        S
61    76.0
Name: age, dtype: float64
14    80.0
Name: age, dtype: float64

In [56]:
# get average age by gender
print((df.groupby(by=['gender'])).age.mean())

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [59]:
# get average age by people survived vs not-survived
dfsurv4 = (df[df.survived=='A']).age.mean()
print(dfsurv4)
dfsurv5 = (df[df.survived=='D']).age.mean()
print(dfsurv5)

28.97471128395037
30.38936817968011